import { nanoid } from 'nanoid'

import { categories } from './categories'

import firstForgeEquipmentPhoto from '../assets/images/equipmentsPhotoData/forging/MA4127/1.jpg'

export const equipmentData = [
	{
		id: nanoid(),
		category: categories.forging,
		model: 'Молот кувальний МА4127',
		photos: [firstForgeEquipmentPhoto],
		features: 'Номінальна вага падаючих частин, кг: 50\nЧисло ударів бойка на хвилину: 225\nЕнергія удару, не менше, кгс*м: 80\nВідстань від осі баби до станини (виліт), мм: 280\nВисота робочої зони у світлі, мм 220\nДовжина дзеркала бойків, мм: 100\nШирина дзеркала бойків, мм: 55\nВідстань від дзеркала нижнього бойка до рівня підлоги, мм 800\nДіаметр циліндра компресора, мм 225\nХід поршня компресора 170\nХід баби (найбільший), мм 300\nЕлектродвигун, кВт 4\nОптимальний перетин заготовки квадратної сторони, що проковується (мм) 50\nОптимальний перетин заготовки, що проковується, круглої-діаметром (мм) 60\nДовжина 1450\nШирина 735\nВисота 1715\nМаса, кг 2170',
		describe: 'Молот ковочный кузнечный пневматический МА4127 с массой падающих частей (МПЧ) 50 кг предназначен для выполнения кузнечных работ: протяжки, пробивки отверстий, горячей рубки металла, гибки металла методом свободной ковки на плоских и фасонных бойках.\nМолот ковочный незаменим при работах по художественной ковке.\nСтанина молота кузнечного МА4127 - цельнолитая чугунная фасонная отливка - является базой, как для монтажа всех узлов, так и для осуществления механических, энергетических и технологических функций молота.'
	},
	{
		id: nanoid(),
		category: categories.forging,
		model: 'Молот кувальний МА4127',
		photos: [firstForgeEquipmentPhoto],
		features: 'Номінальна вага падаючих частин, кг: 50',
		describe: 'Молот ковочный кузнечный пневматический МА4127 с массой падающих частей (МПЧ) 50 кг'
	},
	{
		id: nanoid(),
		category: categories.forging,
		model: 'Молот кувальний МА4127',
		photos: [firstForgeEquipmentPhoto],
		features: 'Номінальна вага падаючих частин, кг: 50',
		describe: 'Молот ковочный кузнечный пневматический МА4127 с массой падающих частей (МПЧ) 50 кг'
	},
	{
		id: nanoid(),
		category: categories.forging,
		model: 'Молот кувальний МА4127',
		photos: [firstForgeEquipmentPhoto],
		features: 'Номінальна вага падаючих частин, кг: 50',
		describe: 'Молот ковочный кузнечный пневматический МА4127 с массой падающих частей (МПЧ) 50 кг'
	},
	{
		id: nanoid(),
		category: categories.forging,
		model: 'Молот кувальний МА4127',
		photos: [firstForgeEquipmentPhoto],
		features: 'Номінальна вага падаючих частин, кг: 50',
		describe: 'Молот ковочный кузнечный пневматический МА4127 с массой падающих частей (МПЧ) 50 кг'
	},
	{
		id: nanoid(),
		category: categories.forging,
		model: 'Молот кувальний МА4127',
		photos: [firstForgeEquipmentPhoto],
		features: 'Номінальна вага падаючих частин, кг: 50',
		describe: 'Молот ковочный кузнечный пневматический МА4127 с массой падающих частей (МПЧ) 50 кг'
	},
	{
		id: nanoid(),
		category: categories.forging,
		model: 'Молот кувальний МА4127',
		photos: [firstForgeEquipmentPhoto],
		features: 'Номінальна вага падаючих частин, кг: 50',
		describe: 'Молот ковочный кузнечный пневматический МА4127 с массой падающих частей (МПЧ) 50 кг'
	},
	{
		id: nanoid(),
		category: categories.forging,
		model: 'Молот кувальний МА4127',
		photos: [firstForgeEquipmentPhoto],
		features: 'Номінальна вага падаючих частин, кг: 50',
		describe: 'Молот ковочный кузнечный пневматический МА4127 с массой падающих частей (МПЧ) 50 кг'
	},
	{
		id: nanoid(),
		category: categories.forging,
		model: 'Молот кувальний МА4127',
		photos: [firstForgeEquipmentPhoto],
		features: 'Номінальна вага падаючих частин, кг: 50',
		describe: 'Молот ковочный кузнечный пневматический МА4127 с массой падающих частей (МПЧ) 50 кг'
	},
]